|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
#Read data and describe it
import pandas as pd
import numpy as np
tf=pd.read_csv("titanic_dataset.csv",delimiter = ',')
print(tf)
print(tf.describe(include='all'))#calc in categorical data

      Unnamed: 0  pclass  survived  \
0              0       1         1
1              1       1         1
2              2       1         0
3              3       1         0
4              4       1         0
...          ...     ...       ...
1304        1304       3         0
1305        1305       3         0
1306        1306       3         0
1307        1307       3         0
1308        1308       3         0

                                                 name  gender      age  sibsp  \
0                       Allen, Miss. Elisabeth Walton  female  29.0000      0
1                      Allison, Master. Hudson Trevor    male   0.9167      1
2                        Allison, Miss. Helen Loraine  female   2.0000      1
3                Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1
...                                               ...     ...      ...    ...
1304                             Zabour, Miss. Hileni  female  14.5000      1
1305                            Zabour, Miss. Thamine  female      NaN      1
1306                        Zakarian, Mr. Mapriededer    male  26.5000      0
1307                              Zakarian, Mr. Ortin    male  27.0000      0
1308                               Zimmerman, Mr. Leo    male  29.0000      0

      parch  ticket      fare    cabin embarked boat   body  \
0         0   24160  $211.34        B5        S    2    NaN
1         2  113781  $151.55   C22 C26        S   11    NaN
2         2  113781  $151.55   C22 C26        S  NaN    NaN
3         2  113781  $151.55   C22 C26        S  NaN  135.0
4         2  113781  $151.55   C22 C26        S  NaN    NaN
...     ...     ...       ...      ...      ...  ...    ...
1304      0    2665   $14.45       NaN        C  NaN  328.0
1305      0    2665   $14.45       NaN        C  NaN    NaN
1306      0    2656    $7.23       NaN        C  NaN  304.0
1307      0    2670    $7.23       NaN        C  NaN    NaN
1308      0  315082    $7.88       NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1309 rows x 15 columns]
         Unnamed: 0       pclass     survived                  name gender  \
count   1309.000000  1309.000000  1309.000000                  1309   1309
unique          NaN          NaN          NaN                  1307      2
top             NaN          NaN          NaN  Connolly, Miss. Kate   male
freq            NaN          NaN          NaN                     2    843
mean     654.000000     2.294882     0.381971                   NaN    NaN
std      378.020061     0.837836     0.486055                   NaN    NaN
min        0.000000     1.000000     0.000000                   NaN    NaN
25%      327.000000     2.000000     0.000000                   NaN    NaN
50%      654.000000     3.000000     0.000000                   NaN    NaN
75%      981.000000     3.000000     1.000000                   NaN    NaN
max     1308.000000     3.000000     1.000000                   NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [2]:
#Find columns with missingdata

# using isnull() function   
obj=tf.isnull().sum()

for key,value in obj.iteritems():
    print(key,",",value)

Unnamed: 0 , 0
pclass , 0
survived , 0
name , 0
gender , 0
age , 263
sibsp , 0
parch , 0
ticket , 0
fare , 1
cabin , 1014
embarked , 2
boat , 823
body , 1188
home.dest , 564

In [3]:
#Print shape of dataset
print(tf.shape)

(1309, 15)

In [1]:
#drop columns with more than 25% missing data
column_with_nan = tf.columns[tf.isnull().any()]
print(tf.shape)
for column in column_with_nan:
    if tf[column].isnull().sum()*100.0/tf.shape[0] > 25:
        tf.drop(column,1, inplace=True)
print(tf.shape)

NameError: name 'tf' is not defined

In [5]:

find columns still having missing/na values and also count of missing data
fill na with mean for fare and age column column.
drop na values for embarked column.
dump the dataframe to a csv file 'titanic_filtered.csv'.

SyntaxError: invalid syntax (<ipython-input-5-dbc15877263e>, line 1)

In [ ]:
#check data types of all columns
#convert price to numeric

dataTypeallcols = tf.dtypes
print(dataTypeallcols)

In [ ]:
print(tf.dtypes)

tf["fare"] = tf['fare'].astype('int')
tf.dtypes

In [ ]:
#find columns still having missing/na values and also count of missing data

print(" \nshow the boolean Dataframe : \n\n", tf.isnull()) 
  
# Count total NaN at each column in a DataFrame 
print(" \nCount total NaN at each column in a DataFrame : \n\n", 
      tf.isnull().sum())

In [ ]:
#fill na with mean for fare and age column column.

tf.isna()
tf.fillna({"age":tf.age.mean()})

In [ ]:

tf["age"] = tf["age"].astype(str).astype(float)
#tf.fillna({"fare":tf.fare.mean()})

In [ ]:
#drop na values for embarked column.
tf.dropna(subset=['embarked'])

In [ ]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
nme = ["aparna", "pankaj", "sudhir", "Geeku"] 
deg = ["MBA", "BCA", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98] 
   
# dictionary of lists  
dict = {'name': nme, 'degree': deg, 'score': scr}  
     
df = pd.DataFrame(dict) 
  
# saving the dataframe 
df.to_csv('titanic_filtered.csv')

In [ ]:
#for surviced column replace 0 with D and 1 with A
tf['survived'] = tf['survived'].replace([0,1],['D','A'])
print (tf)

In [ ]:
#find the frequency of different values in survived column
 
count1=tf['survived'].value_counts()
print(count1)

In [ ]:
#group by gender and survived and see the counts in each category
count = tf.groupby(['survived']).count()
print(count)
#find different pclass and no of people in each class

In [ ]:
(tf.groupby(['gender', 'survived']).size() 
   .sort_values(ascending=False) 
   .reset_index(name='count') 
   .drop_duplicates(subset='survived'))

In [ ]:
#find different pclass and no of people in each class

count1=tf['pclass'].value_counts().rename_axis('diff_pclass').reset_index(name='no of people')
print(count1)

In [ ]:
#find top 5 people with highest values of age. Count no of male and females in the top 5


max_value = tf["age"]. max() 
print(max_value)
tf['gender'].groupby(tf['age']).value_counts().head(5)

In [ ]:




#get average age by people survived vs not-survived

In [ ]:
tf['age'].groupby(tf['survived']).value_counts()

In [6]:
#get average age by gender
tf.groupby('gender', as_index=False).age.mean()

   gender        age
0  female  28.687071
1    male  30.585233

In [7]:
#get average age by people survived vs not-survived
tf.groupby('survived', as_index=False).age.mean()

   survived        age
0         0  30.545369
1         1  28.918228

In [20]:
#find max age male and female who survived
grouped_df = tf.groupby(["survived", "gender"], as_index=False)

grouped_df.age.max()

   survived  gender   age
0         0  female  63.0
1         0    male  74.0
2         1  female  76.0
3         1    male  80.0